app/controllers/articles_controller.rb

  def index
    @articles = Article.all
---
SELECT "articles".* FROM "articles" ORDER BY title asc

def create

  error_flag, @article = Article.create_article(article_params)
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Mail"], ["text", "Fixx"], ["created_at", 2016-10-20 07:16:37 UTC], ["updated_at", 2016-10-20 07:16:37 UTC]]

def get_articles

  article_array = Article.build_json_article_list(params[:start].to_i,params[:length].to_i)
  article_json = {"recordsFiltered"=> Article.count,"recordsTotal"=> Article.count, "data"=> article_array}
---
SELECT COUNT(*) FROM "articles"