app/controllers/subscribers_controller.rb

SELECT "subscribers".* FROM "subscribers"
---
  def index
  	@subscribers = Subscriber.all

SELECT  "subscribers".* FROM "subscribers" WHERE "subscribers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @subscriber = Subscriber.find(params[:id])

SELECT  "subscribers".* FROM "subscribers" WHERE "subscribers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @subscriber = Subscriber.find(params[:id])

INSERT INTO "subscribers" ("name", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "sfs"], ["body", "dsf"], ["created_at", 2017-03-28 06:28:55 UTC], ["updated_at", 2017-03-28 06:28:55 UTC]]
---
  def create
	 @subscriber = Subscriber.new(subscriber_params)
     if	@subscriber.save

SELECT  "subscribers".* FROM "subscribers" WHERE "subscribers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subscribers" SET "name" = $1, "body" = $2, "updated_at" = $3 WHERE "subscribers"."id" = $4  [["name", "sfsdfg"], ["body", "dsfdfg"], ["updated_at", 2017-03-28 09:41:18 UTC], ["id", 1]]
---
  def update
    @subscriber = Subscriber.find(params[:id])
      if @subscriber.update(subscriber_params)

SELECT  "subscribers".* FROM "subscribers" WHERE "subscribers"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "subscribers" WHERE "subscribers"."id" = $1  [["id", 5]]
---
  def destroy
    @subscriber = Subscriber.find(params[:id])
    @subscriber.destroy